import type { FooterNavLinksListProps } from "../ui/components/FooterNavLinksList/model/types";

export const FooterNavData: FooterNavLinksListProps[] = [
    {
        title: 'Детям',
        links: [
            {text: 'Робототехника', to: '/', label: 'Обучения детей: Робототехника'},
            {text: 'Создание игр', to: '/', label: 'Обучения детей: Создание игр'},
            {text: 'Программирование', to: '/', label: 'Обучения детей: Программирование'},
            {text: 'Мультимедиа', to: '/', label: 'Обучения детей: Мультимедиа'},
            {text: 'Soft skills', to: '/', label: 'Обучения детей: Soft skills'},
            {text: 'Шахматы', to: '/', label: 'Обучения детей: Шахматы'},
            {text: 'Блогинг', to: '/', label: 'Обучения детей: Блогинг'},
            {text: 'Создание игр', to: '/', label: 'Обучения детей: Создание игр'},
            {text: 'Программирование', to: '/', label: 'Обучения детей: Программирование'},
            {text: 'Мультимедиа', to: '/', label: 'Обучения детей: Мультимедиа'},
            {text: 'Soft skills', to: '/', label: 'Обучения детей: Soft skills'},
        ]
    },
    {
        title: 'Подросткам',
        links: [
            {text:'Web-разработка', to: '/', label: 'Обучения подростков: Web-разработка'},
            {text:'Прикладное программирование', to: '/', label: 'Обучения подростков: Прикладное программирование'},
            {text:'Графическое моделирование', to: '/', label: 'Обучения подростков: Графическое моделирование'},
            {text:'Game Development', to: '/', label: 'Обучения подростков: Game Development'},
            {text: 'Soft skills', to: '/', label: 'Обучения подростков: Soft skills'},
            {text:'Разработчик мобильных приложений', to: '/', label: 'Обучения подростков: Разработчик мобильных приложений'},
            {text:'Блогинг', to: '/', label: 'Обучения подростков: Блогинг'},
            {text:'Создание игр', to: '/', label: 'Обучения подростков: Создание игр'},
            {text:'Программирование', to: '/', label: 'Обучения подростков: Программирование'},
            {text:'Мультимедиа', to: '/', label: 'Обучения подростков: Мультимедиа'},
            {text: 'Soft skills', to: '/', label: 'Обучения подростков: Soft skills'},
        ]
    },
    {
        title: 'Взрослым',
        links: [
            {text:'Разработчик игр на Unity', to: '/', label: 'Обучения взрослых: Разработчик игр на Unity'},
            {text:'Разработка ПО', to: '/', label: 'Обучения взрослых: Разработка ПО'},
            {text:'Графический Дизайн', to: '/', label: 'Обучения взрослых: Графический Дизайн'},
            {text:'Тестировщик ПО', to: '/', label: 'Обучения взрослых: Тестировщик ПО'},
            {text: 'Интернет Маркетинг', to: '/', label: 'Обучения взрослых: Интернет Маркетинг'},
            {text:'Java-разработчик', to: '/', label: 'Обучения взрослых: Java-разработчик'},
            {text:'Python–разработчик', to: '/', label: 'Обучения взрослых: Python–разработчик'},
            {text:'IOS-разработчик', to: '/', label: 'Обучения взрослых: IOS-разработчик'},
            {text:'Программирование', to: '/', label: 'Обучения взрослых: Программирование'},
        ]
    },
    {
        title: 'Информация',
        links: [
            {text:'Об академии', to: '/', label: 'Информация о нас: Об академии'},
            {text:'Мероприятия', to: '/', label: 'Информация о нас: Мероприятия'},
            {text:'Новости', to: '/', label: 'Информация о нас: Новости'},
            {text:'База знаний', to: '/', label: 'Информация о нас: База знаний'},
            {text: 'Карьера', to: '/', label: 'Информация о нас: Карьера'},
            {text:'Контакты', to: '/', label: 'Информация о нас: Контакты'},
        ]
    },

]